In [1]:
# from Univariate import Univariate
import pandas as pd
import numpy as np

In [3]:
dataset=pd.read_csv("Placement_Data_Full_Class.csv")
dataset

,sl_no,gender,ssc_p,ssc_b,hsc_p,hsc_b,hsc_s,degree_p,degree_t,workex,etest_p,specialisation,mba_p,status,salary
0,1,M,67.00,Others,91.00,Others,Commerce,58.00,Sci&Tech,No,55.0,Mkt&HR,58.80,Placed,270000.0
1,2,M,79.33,Central,78.33,Others,Science,77.48,Sci&Tech,Yes,86.5,Mkt&Fin,66.28,Placed,200000.0
2,3,M,65.00,Central,68.00,Central,Arts,64.00,Comm&Mgmt,No,75.0,Mkt&Fin,57.80,Placed,250000.0
3,4,M,56.00,Central,52.00,Central,Science,52.00,Sci&Tech,No,66.0,Mkt&HR,59.43,Not Placed,NaN
4,5,M,85.80,Central,73.60,Central,Commerce,73.30,Comm&Mgmt,No,96.8,Mkt&Fin,55.50,Placed,425000.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
210,211,M,80.60,Others,82.00,Others,Commerce,77.60,Comm&Mgmt,No,91.0,Mkt&Fin,74.49,Placed,400000.0
211,212,M,58.00,Others,60.00,Others,Science,72.00,Sci&Tech,No,74.0,Mkt&Fin,53.62,Placed,275000.0
212,213,M,67.00,Others,67.00,Others,Commerce,73.00,Comm&Mgmt,Yes,59.0,Mkt&Fin,69.72,Placed,295000.0
213,214,F,74.00,Others,66.00,Others,Commerce,58.00,Comm&Mgmt,No,70.0,Mkt&HR,60.23,Placed,204000.0
214,215,M,62.00,Central,58.00,Others,Science,53.00,Comm&Mgmt,No,89.0,Mkt&HR,60.22,Not Placed,NaN

In [5]:
dataset.isnull()

,sl_no,gender,ssc_p,ssc_b,hsc_p,hsc_b,hsc_s,degree_p,degree_t,workex,etest_p,specialisation,mba_p,status,salary
0,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
1,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
3,False,False,False,False,False,False,False,False,False,False,False,False,False,False,True
4,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
210,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
211,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
212,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
213,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
214,False,False,False,False,False,False,False,False,False,False,False,False,False,False,True

In [7]:
dataset.isnull().sum()

sl_no              0
gender             0
ssc_p              0
ssc_b              0
hsc_p              0
hsc_b              0
hsc_s              0
degree_p           0
degree_t           0
workex             0
etest_p            0
specialisation     0
mba_p              0
status             0
salary            67
dtype: int64

# 67 studnet salary have null value because they haven't placed so we can assign 0 for null value of sudent salary

In [11]:
dataset.fillna(0,inplace=True)

In [13]:
dataset.isnull().sum()

sl_no             0
gender            0
ssc_p             0
ssc_b             0
hsc_p             0
hsc_b             0
hsc_s             0
degree_p          0
degree_t          0
workex            0
etest_p           0
specialisation    0
mba_p             0
status            0
salary            0
dtype: int64

In [16]:
# Deletethe null value rows
dataset.dropna(inplace=True)

In [18]:
dataset

,sl_no,gender,ssc_p,ssc_b,hsc_p,hsc_b,hsc_s,degree_p,degree_t,workex,etest_p,specialisation,mba_p,status,salary
0,1,M,67.00,Others,91.00,Others,Commerce,58.00,Sci&Tech,No,55.0,Mkt&HR,58.80,Placed,270000.0
1,2,M,79.33,Central,78.33,Others,Science,77.48,Sci&Tech,Yes,86.5,Mkt&Fin,66.28,Placed,200000.0
2,3,M,65.00,Central,68.00,Central,Arts,64.00,Comm&Mgmt,No,75.0,Mkt&Fin,57.80,Placed,250000.0
3,4,M,56.00,Central,52.00,Central,Science,52.00,Sci&Tech,No,66.0,Mkt&HR,59.43,Not Placed,0.0
4,5,M,85.80,Central,73.60,Central,Commerce,73.30,Comm&Mgmt,No,96.8,Mkt&Fin,55.50,Placed,425000.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
210,211,M,80.60,Others,82.00,Others,Commerce,77.60,Comm&Mgmt,No,91.0,Mkt&Fin,74.49,Placed,400000.0
211,212,M,58.00,Others,60.00,Others,Science,72.00,Sci&Tech,No,74.0,Mkt&Fin,53.62,Placed,275000.0
212,213,M,67.00,Others,67.00,Others,Commerce,73.00,Comm&Mgmt,Yes,59.0,Mkt&Fin,69.72,Placed,295000.0
213,214,F,74.00,Others,66.00,Others,Commerce,58.00,Comm&Mgmt,No,70.0,Mkt&HR,60.23,Placed,204000.0
214,215,M,62.00,Central,58.00,Others,Science,53.00,Comm&Mgmt,No,89.0,Mkt&HR,60.22,Not Placed,0.0

# 2)How many of them are not placed?

In [21]:
np=dataset[dataset['status']=='Not Placed']['status']
np

3      Not Placed
5      Not Placed
6      Not Placed
9      Not Placed
12     Not Placed
          ...
198    Not Placed
201    Not Placed
206    Not Placed
208    Not Placed
214    Not Placed
Name: status, Length: 67, dtype: object

# 3)Find the reason for non placement from the dataset?

In [79]:
np=dataset[dataset['status']=='Placed']['ssc_p'].value_counts().index
np

Index([ 73.0,  65.0,  63.0,  67.0,  77.0,  69.0,  74.0,  62.0,  58.0,  82.0,
        84.0,  79.0,  80.0,  66.5,  72.0,  70.0,  64.0,  61.0,  87.0,  68.0,
        84.2,  71.0,  66.0,  85.0,  60.0,  76.0,  80.4,  89.4,  76.7,  60.8,
        74.9, 77.44, 77.67, 67.16,  75.4,  49.0,  53.0,  74.2, 73.96, 73.24,
        59.0,  88.0,  78.5,  65.2, 83.96, 55.68, 83.33,  68.2,  64.6,  69.5,
        60.4,  85.8,  69.6,  69.8,  77.4,  76.5, 76.76,  81.0,  78.0,  75.2,
        52.6, 60.23,  86.5,  83.0, 80.92,  75.0, 84.86, 79.33,  56.6,  81.7,
       83.84,  80.6],
      dtype='float64', name='ssc_p')

In [91]:
freq_table= pd.DataFrame(columns=['uniquevalue','frequency'])
freq_table

Empty DataFrame
Columns: [uniquevalue, frequency]
Index: []

In [93]:
freq_table['uniquevalue']=dataset[dataset['status']=='Not Placed']['mba_p'].value_counts().index
freq_table['frequency']=dataset[dataset['status']=='Not Placed']['mba_p'].value_counts().values
freq_table

    uniquevalue  frequency
0         59.43          1
1         69.28          1
2         58.81          1
3         64.15          1
4         61.58          1
..          ...        ...
62        55.41          1
63        69.03          1
64        59.47          1
65        64.95          1
66        60.22          1

[67 rows x 2 columns]

In [87]:
freq_table= pd.DataFrame(columns=['uniquevalue','frequency'])
freq_table

Empty DataFrame
Columns: [uniquevalue, frequency]
Index: []

In [89]:
freq_table['uniquevalue']=dataset[dataset['status']=='Placed']['mba_p'].value_counts().index
freq_table['frequency']=dataset[dataset['status']=='Placed']['mba_p'].value_counts().values
freq_table

     uniquevalue  frequency
0          56.70          3
1          62.48          2
2          61.29          2
3          68.07          2
4          58.80          1
..           ...        ...
138        58.46          1
139        58.78          1
140        59.69          1
141        57.24          1
142        60.23          1

[143 rows x 2 columns]

In [25]:
from scipy.stats import ttest_ind
placed=dataset[dataset['status']=='Placed']['ssc_p']
Nonplaced=dataset[dataset['status']=='Not Placed']['ssc_p']
ttest_ind(placed,Nonplaced)

TtestResult(statistic=11.173294337111484, pvalue=4.115201043884403e-23, df=213.0)

# p <0.05 so Reject Null Hypothesis and accept alternate hypothesis
# Interprete : There are  significant different between placed and not placed student ssc_p mark

In [29]:
placed=dataset[dataset['status']=='Placed']['hsc_p']
Nonplaced=dataset[dataset['status']=='Not Placed']['hsc_p']
ttest_ind(placed,Nonplaced)

TtestResult(statistic=8.230746477379519, pvalue=1.849212756931434e-14, df=213.0)

# p <0.05 so Reject Null Hypothesis and accept alternate hypothesis
# Interprete : There are  significant different between placed and not placed student hsc_p mark

In [31]:
placed=dataset[dataset['status']=='Placed']['degree_p']
Nonplaced=dataset[dataset['status']=='Not Placed']['degree_p']
ttest_ind(placed,Nonplaced)

TtestResult(statistic=7.982429212839097, pvalue=8.807682138862608e-14, df=213.0)

# p <0.05 so Reject Null Hypothesis and accept alternate hypothesis
# Interprete : There are  significant different between placed and not placed student degree_p mark

In [81]:
placed=dataset[dataset['status']=='Placed']['etest_p']
Nonplaced=dataset[dataset['status']=='Not Placed']['etest_p']
ttest_ind(placed,Nonplaced)

TtestResult(statistic=1.8781977946559039, pvalue=0.061720381110174166, df=213.0)

# p >0.05 so Accept Null Hypothesis and Reject alternate hypothesis
# Interprete : There are  no significant different between placed and not placed student entrance test mark

In [83]:
placed=dataset[dataset['status']=='Placed']['mba_p']
Nonplaced=dataset[dataset['status']=='Not Placed']['mba_p']
ttest_ind(placed,Nonplaced)

TtestResult(statistic=1.1259706009659818, pvalue=0.26144500197748627, df=213.0)

# p <0.05 so Reject Null Hypothesis and Accept alternate hypothesis
# Interprete : There are  significant different between placed and not placed student mba_p mark

# Who have got less marks in ssc_p, hsc_p and mba_p they didn't placed

# 4)What kind of relation between salary and mba_p

In [ ]:
def qualQuan(dataset):
    quan=[]
    qual=[]
    for cn in dataset.columns:
        if(dataset[cn].dtype == 'O'):
            qual.append(cn)
        else:
            quan.append(cn)
    return qual, quan

In [ ]:
qual,quan=qualQuan(dataset)
print(qual)
print(quan)
del quan[0]
print("After Delete Slno : ",quan)

In [ ]:
dataset[quan]

In [ ]:
dataset[quan].corr()

In [ ]:
"""
correlation(salary,mba_p?) = 13%  postive relation 
It is weak relaonship
"""

In [ ]:
dataset[quan].cov()

In [ ]:
"""
covarience(salary,mba_p?) = 126245%  postive covarience 
"""

In [ ]:
import statsmodels.api as sm
from statsmodels.formula.api import ols
model=ols('salary~mba_p', data=dataset[quan]).fit()
anova_result = sm.stats.anova_lm(model, type=2)
anova_result

# p<0.5 so Regect Null Hypothesis - There are no significant relation between salary and mba marks

# 5)Which specialization is getting minimum salary?

In [ ]:
dataset['specialisation'].value_counts()

In [ ]:
# specialisation Mkt&HR Mkt&Fin

Hr = dataset[(dataset['specialisation']=='Mkt&HR')&(dataset['salary']>0)]['salary']
Fin = dataset[(dataset['specialisation']=='Mkt&Fin')&(dataset['salary']>0)]['salary']
print('Minimum Salary of Mkt&HR : ',Hr.min())
print('Minimum Salary of Mkt&Fin : ',Fin.min())

# HR and Finance both specilization have got mnimum salary Ra 20000

# 6) How many of them getting above 500000 salary?

In [ ]:
dataset[dataset['salary']>500000] ['salary']

In [ ]:
salaryabove5L=(dataset['salary']>500000).sum()
print(salaryabove5L," sudnet got above 5L Salary")

# 3  studnet have got above 5L Salary

# 7)Test the Analysis of Variance between etest_p and mba_p at signifance level 5%.(Make decision using Hypothesis Testing)

In [ ]:
dataset[quan].cov()

# covariance(etest_p,mba_p) = 16% Positive relation

In [ ]:
# T Testdataset[quan].cov()
from scipy.stats import ttest_inddataset[quan].cov()
ttest_ind(dataset['etest_p'],dataset['mba_p'])

# T test p < 0.05

In [ ]:
import scipy.stats as stats
stats.f_oneway(dataset['etest_p'],dataset['mba_p'])

# Oneway p < 0.05

In [ ]:
import statsmodels.api as sm
from statsmodels.formula.api import ols
model=ols('etest_p~mba_p', data=dataset).fit()
anova_result = sm.stats.anova_lm(model, type=2)
anova_result

# p<0.05 Reject Null hypothesis and Accept Alternate Hypothesis
# There are no significant diffrence between entrance test and MBA degree mark

# 8)Test the similarity between the degree_t(Sci&Tech) and specialisation( Mkt&HR) with respect to salary at significance level of 5%.(Make decision using Hypothesis Testing)

# Different group(degree_t, Specilizaation) but same condition(salary)

In [ ]:
SciTech=dataset[dataset['degree_t']=='Sci&Tech']['salary']
MKHR=dataset[dataset['specialisation']=='Mkt&HR']['salary']
ttest_ind(SciTech,MKHR)

# p<0.05 Reject Null Hypothesis and Accept Altenate Hypothesis
# They are no significant diference between degree_t sci&tech branch and  mba MKT&HR specilization of salary

# 9)Convert the normal distribution to standard normal distribution for salary column

In [ ]:
def stdNormDistGraph(dataset):
    # convert to standard Normal Disribution
    import seaborn as sns
    mean = dataset.mean()
    std = dataset.std()
    values = [n for n in dataset]
    z_score=[((i-mean)/std) for i in values]
    sns.histplot(z_score,kde=True)
    print("sum : %3f " %(sum(z_score)))
    print(len(z_score))
    print(sum(z_score)/len(z_score))
    return z_score

In [ ]:
zscore=stdNormDistGraph(dataset['salary'])

In [ ]:
df=pd.DataFrame(zscore)

a=list(df[0])
print("sum : %3f" %(sum(a)))
m=df.mean()
s=df.std()
print("mean : ", m,"std : ",s)

# 10)What is the probability Density Function of the salary range from 700000 to 900000?

In [ ]:
import seaborn as sns
# Distribution plot use distplot
import seaborn as sns
sns.distplot(dataset["ssc_p"])

In [ ]:
def get_pdf_probabiliy(dataset,startrange, endrange):
    from matplotlib import pyplot
    from scipy.stats import norm
    import seaborn as sns
    # sns.distplot(dataset, kde = True, color="Yellow",kde_kws={"color": "blue"})
    ax=sns.histplot(dataset, kde=True,stat="density",color="Green", kde_kws=dict(cut=3))
    
    # kde- KERNEL DENSITY
    # kde_kws - density color
    # histogram color  is yellow

    pyplot.axvline(startrange,color="Red")  # v mean vertical line
    pyplot.axvline(endrange,color="Red")
    # Generate Sample
    sample = dataset
    # Calculate parameters
    sample_mean=sample.mean()
    sample_std=sample.std()
    print("Mean=%.3f,Standard Deviation = %.3f" % (sample_mean,sample_std))
    # DEfine the Disribution
    dist= norm(sample_mean,sample_std)  # learn normal distribution pattern
    # print("dist : ",dist)
    
    # smple probabilities or a range of outcomes
    values =[value for value in range(startrange,endrange)] # stoe value in list
    probabilties = [dist.pdf(value) for value in values] # each value give to dist paten and sum the values pdf -probabiliy densiy funcion
    print("Print each Dist vale : ", probabilties)
    prob=sum(probabilties)
    print("The area between range({},{}):{}".format(startrange,endrange,prob))
    return prob

In [ ]:
get_pdf_probabiliy(dataset["salary"],700000,900000)

# 11)Test the similarity between the degree_t(Sci&Tech)with respect to etest_p and mba_p at significance level of 5%.(Make decision using Hypothesis Testing)

# Dependent Paired T-Test
# Group(same -categorical data) but different condition(etest_p,mba_p Numerical data)Â¶

In [ ]:
sci1=dataset[dataset['degree_t']=='Sci&Tech']['etest_p']
sci2=dataset[dataset['degree_t']=='Sci&Tech']['mba_p']
ttest_ind(sci1,sci2)

# p >0.05 so accept Null hypothesis
# INTEREPRETE : THERE ARE NO SIGNIFICANT DIFFERENT BETWEEN etest_p  AND MBA_p MARKE OF SCI&Tech branch

# 12)Which parameter is highly correlated with salary?

In [ ]:
dataset[quan].corr()

In [ ]:
cm=dataset[quan].corr()

In [ ]:
salary_correlations = cm['salary'].sort_values(ascending=False)
print(salary_correlations)